#+title: apis
** variables and scripting
- reuse values (dont repeat yourself dry)
- hide sensitive values like api keys from being publicly shared
- variable scopes: global, collection, environment, data, local
- syntax {{variableName}} 
- {{baseURL}} - collections > variables; or select and hover over the base url
- scripting: node.js is a runtime environment for executing JavaScript code outside of a web browser

#+begin_src js
  console.log("hello, org mode");
  // single line comment
  /* multi
     line
     comment */
  //console.log(pm.response.json())
  //pm.collectionVariables.set("variableName", value)
  //pm.collectionVariables.get("variableName")
  // -- Defining variables with const --
  //const myVar = "This variable can't be reassigned"
  //console.log(myVar) // => This variable can't be reassigned

  // attempt to reassign the value of myVar
  //myVar = "foo" 
  //=> [ERROR!] Uncaught TypeError: Assignment to constant variable.

  // -- Defining variables with let -- 
  //let myVar2 = "I can change!"
  //console.log(myVar2) // => I can change!

  //myVar2 = "See, I changed!"
  //console.log(myVar2) // => See, I changed!

#+end_src

#+RESULTS:
: hello, org mode
: undefined

